SiliconLabs/simplicity_sdk/platform/radio/rail_lib/chip/efr32/protocol_config/efr32xg23/zwave_efr32xg23_configurator_out.c
const uint32_t zwave_100kb_beam_lowside_0_modemConfig[] = {
  0x03014FFCUL, (uint32_t) &phyInfo_4, /* Write: SEQ.PHYINFO */
  0x0002400CUL, 0x00000000UL, /* Write: FRC.DFLCTRL */
  /*    4010 */ 0x00004000UL, /* FRC.MAXLENGTH */
  0x00024020UL, 0x00000007UL, /* Write: FRC.WCNTCMP0 */
  /*    4024 */ 0x00000000UL, /* FRC.WCNTCMP1 */
  0x00014048UL, 0x00000704UL, /* Write: FRC.CTRL */
  0x00044108UL, 0x000040FFUL, /* Write: FRC.FCD0 */
  /*    410C */ 0x00000000UL, /* FRC.FCD1 */
  /*    4110 */ 0x000041FFUL, /* FRC.FCD2 */
  /*    4114 */ 0x00000000UL, /* FRC.FCD3 */
  0x1001C020UL, 0x0007F800UL, /* AND: AGC.CTRL0 */
  0x3001C020UL, 0x002801FEUL, /* OR: AGC.CTRL0 */
  0x0001C03CUL, 0x00000000UL, /* Write: AGC.CTRL7 */
  0x0004C058UL, 0xE6240027UL, /* Write: AGC.AGCPERIOD0 */
  /*    C05C */ 0x00000075UL, /* AGC.AGCPERIOD1 */
  /*    C060 */ 0x23211D0AUL, /* AGC.HICNTREGION0 */
  /*    C064 */ 0x00000024UL, /* AGC.HICNTREGION1 */
  0x0001C06CUL, 0x00000000UL, /* Write: AGC.GAINSTEPLIM0 */
  0x01010008UL, 0x000007A4UL, /* Write: RFCRC.CTRL */
  0x01010018UL, 0x0000F0B8UL, /* Write: RFCRC.INIT */
  0x01010020UL, 0x00008408UL, /* Write: RFCRC.POLY */
  0x01014040UL, 0x11900000UL, /* Write: MODEM.AFCADJRX */
  0x0104404CUL, 0x04000002UL, /* Write: MODEM.CTRL0 */
  /*    4050 */ 0x0082C00FUL, /* MODEM.CTRL1 */
  /*    4054 */ 0x20000200UL, /* MODEM.CTRL2 */
  /*    4058 */ 0x000BD000UL, /* MODEM.CTRL3 */
  0x010F4060UL, 0x00000000UL, /* Write: MODEM.CTRL5 */
  /*    4064 */ 0x00000000UL, /* MODEM.CTRL6 */
  /*    4068 */ 0x00FC2FFDUL, /* MODEM.TXBR */
  /*    406C */ 0x00000C41UL, /* MODEM.RXBR */
  /*    4070 */ 0x00000040UL, /* MODEM.CF */
  /*    4074 */ 0x001C0012UL, /* MODEM.PRE */
  /*    4078 */ 0x00000FAAUL, /* MODEM.SYNC0 */
  /*    407C */ 0x00000000UL, /* MODEM.SYNC1 */
  /*    4080 */ 0x0000060AUL, /* MODEM.TIMING */
  /*    4084 */ 0x00000000UL, /* MODEM.DSSS0 */
  /*    4088 */ 0x00080392UL, /* MODEM.MODINDEX */
  /*    408C */ 0x62038000UL, /* MODEM.AFC */
  /*    4090 */ 0x00000000UL, /* MODEM.AFCADJLIM */
  /*    4094 */ 0x21100602UL, /* MODEM.SHAPING0 */
  /*    4098 */ 0x524E4434UL, /* MODEM.SHAPING1 */
  0x0102411CUL, 0x8C208000UL, /* Write: MODEM.SRCCHF */
  /*    4120 */ 0x00000000UL, /* MODEM.INTAFC */
  0x01074138UL, 0xF00A20BCUL, /* Write: MODEM.DSACTRL */
  /*    413C */ 0x005EC4F0UL, /* MODEM.DIGMIXCTRL */
  /*    4140 */ 0x40AF7929UL, /* MODEM.VITERBIDEMOD */
  /*    4144 */ 0xAA0FFFFFUL, /* MODEM.VTCORRCFG0 */
  /*    4148 */ 0xB23943AFUL, /* MODEM.VTCORRCFG1 */
  /*    414C */ 0x00403B89UL, /* MODEM.VTTRACK */
  /*    4150 */ 0x800003C0UL, /* MODEM.VTBLETIMING */
  0x0101415CUL, 0x0000FDFFUL, /* Write: MODEM.CGCLKSTOP */
  0x0106416CUL, 0x40000000UL, /* Write: MODEM.LONGRANGE1 */
  /*    4170 */ 0x00000000UL, /* MODEM.LONGRANGE2 */
  /*    4174 */ 0x00000000UL, /* MODEM.LONGRANGE3 */
  /*    4178 */ 0x00000000UL, /* MODEM.LONGRANGE4 */
  /*    417C */ 0x00000000UL, /* MODEM.LONGRANGE5 */
  /*    4180 */ 0x00000000UL, /* MODEM.LONGRANGE6 */
  0x01044188UL, 0x00000000UL, /* Write: MODEM.COH0 */
  /*    418C */ 0x00000000UL, /* MODEM.COH1 */
  /*    4190 */ 0x00000000UL, /* MODEM.COH2 */
  /*    4194 */ 0x00000000UL, /* MODEM.COH3 */
  0x010141A8UL, 0x00000000UL, /* Write: MODEM.DIGIGAINCTRL */
  0x010141B4UL, 0xC02F952CUL, /* Write: MODEM.REALTIMCFE */
  0x010341D0UL, 0xAAAAAAAAUL, /* Write: MODEM.TRECPMPATT */
  /*    41D4 */ 0x803200D2UL, /* MODEM.TRECPMDET */
  /*    41D8 */ 0x00560007UL, /* MODEM.TRECSCFG */
  0x010F41E4UL, 0x2CDDCFE2UL, /* Write: MODEM.CHFCOE00 */
  /*    41E8 */ 0x003AB67EUL, /* MODEM.CHFCOE01 */
  /*    41EC */ 0x00190960UL, /* MODEM.CHFCOE02 */
  /*    41F0 */ 0x00E22251UL, /* MODEM.CHFCOE03 */
  /*    41F4 */ 0x0E51B94CUL, /* MODEM.CHFCOE04 */
  /*    41F8 */ 0x04A98239UL, /* MODEM.CHFCOE05 */
  /*    41FC */ 0x299B22D8UL, /* MODEM.CHFCOE06 */
  /*    4200 */ 0x0C81901EUL, /* MODEM.CHFCOE10 */
  /*    4204 */ 0x0006490CUL, /* MODEM.CHFCOE11 */
  /*    4208 */ 0x006DDFA8UL, /* MODEM.CHFCOE12 */
  /*    420C */ 0x00B10BC0UL, /* MODEM.CHFCOE13 */
  /*    4210 */ 0x00A53D18UL, /* MODEM.CHFCOE14 */
  /*    4214 */ 0x05020AE8UL, /* MODEM.CHFCOE15 */
  /*    4218 */ 0x1DD71B27UL, /* MODEM.CHFCOE16 */
  /*    421C */ 0x80000000UL, /* MODEM.CHFCTRL */
  0x01024224UL, 0x00000058UL, /* Write: MODEM.FRMSCHTIME */
  /*    4228 */ 0x00000000UL, /* MODEM.PREFILTCOEFF */
  0x01024230UL, 0x00500001UL, /* Write: MODEM.SQ */
  /*    4234 */ 0x00200040UL, /* MODEM.SQEXT */
  0x0101424CUL, 0x04060008UL, /* Write: MODEM.PHDMODCTRL */
  0x01044330UL, 0x00000000UL, /* Write: MODEM.BCRCTRL0 */
  /*    4334 */ 0x00000000UL, /* MODEM.BCRCTRL1 */
  /*    4338 */ 0x00000000UL, /* MODEM.BCRDEMODCTRL */
  /*    433C */ 0x00000000UL, /* MODEM.BCRDEMODOOK */
  0x010A4344UL, 0x00000000UL, /* Write: MODEM.BCRDEMODAFC1 */
  /*    4348 */ 0x00000000UL, /* MODEM.BCRDEMOD4FSK0 */
  /*    434C */ 0x00000000UL, /* MODEM.BCRDEMOD4FSK1 */
  /*    4350 */ 0x00000000UL, /* MODEM.BCRDEMODANT */
  /*    4354 */ 0x00000000UL, /* MODEM.BCRDEMODRSSI */
  /*    4358 */ 0x00000000UL, /* MODEM.BCRDEMODARR0 */
  /*    435C */ 0x38000000UL, /* MODEM.BCRDEMODARR1 */
  /*    4360 */ 0x00000000UL, /* MODEM.BCRDEMODARR2 */
  /*    4364 */ 0x00000000UL, /* MODEM.BCRDEMODKSI */
  /*    4368 */ 0x58FF0000UL, /* MODEM.BCRDEMODPMEXP */
  0x01018038UL, 0x00004EC4UL, /* Write: SYNTH.IFFREQ */
  0x010180A4UL, 0x0003B870UL, /* Write: SYNTH.LPFCTRL1TX */
  0x110180ACUL, 0x000001F6UL, /* AND: SYNTH.LPFCTRL2TX */
  0x310180ACUL, 0x01014201UL, /* OR: SYNTH.LPFCTRL2TX */
  0x010180B4UL, 0x02000300UL, /* Write: SYNTH.DSMCTRLTX */
  0x0201016CUL, 0x00062000UL, /* Write: RAC.TX */
  0x02010174UL, 0x0C100169UL, /* Write: RAC.SYTRIM0 */
  0x12010180UL, 0x00000779UL, /* AND: RAC.SYEN */
  0x32010180UL, 0x00000006UL, /* OR: RAC.SYEN */
  0x02010188UL, 0x00000090UL, /* Write: RAC.SYMMDCTRL */
  0xFFFFFFFFUL,
};

const uint32_t zwave_40kb_beam_0_modemConfig[] = {
  0x03014FFCUL, (uint32_t) &phyInfo_0, /* Write: SEQ.PHYINFO */
  0x0002400CUL, 0x00000000UL, /* Write: FRC.DFLCTRL */
  /*    4010 */ 0x00004000UL, /* FRC.MAXLENGTH */
  0x00024020UL, 0x00000007UL, /* Write: FRC.WCNTCMP0 */
  /*    4024 */ 0x00000000UL, /* FRC.WCNTCMP1 */
  0x00014048UL, 0x00000704UL, /* Write: FRC.CTRL */
  0x00044108UL, 0x000040FFUL, /* Write: FRC.FCD0 */
  /*    410C */ 0x00000000UL, /* FRC.FCD1 */
  /*    4110 */ 0x000041FFUL, /* FRC.FCD2 */
  /*    4114 */ 0x00000000UL, /* FRC.FCD3 */
  0x1001C020UL, 0x0007F800UL, /* AND: AGC.CTRL0 */
  0x3001C020UL, 0x002801FEUL, /* OR: AGC.CTRL0 */
  0x0001C03CUL, 0x00000000UL, /* Write: AGC.CTRL7 */
  0x0004C058UL, 0xE61A001CUL, /* Write: AGC.AGCPERIOD0 */
  /*    C05C */ 0x00000054UL, /* AGC.AGCPERIOD1 */
  /*    C060 */ 0x1918150AUL, /* AGC.HICNTREGION0 */
  /*    C064 */ 0x0000001AUL, /* AGC.HICNTREGION1 */
  0x0001C06CUL, 0x00000500UL, /* Write: AGC.GAINSTEPLIM0 */
  0x01010008UL, 0x000007A0UL, /* Write: RFCRC.CTRL */
  0x01010018UL, 0x000000FFUL, /* Write: RFCRC.INIT */
  0x01010020UL, 0x00000080UL, /* Write: RFCRC.POLY */
  0x01014040UL, 0x30F00000UL, /* Write: MODEM.AFCADJRX */
  0x0104404CUL, 0x04000002UL, /* Write: MODEM.CTRL0 */
  /*    4050 */ 0x0082C02DUL, /* MODEM.CTRL1 */
  /*    4054 */ 0x20003200UL, /* MODEM.CTRL2 */
  /*    4058 */ 0x000BD000UL, /* MODEM.CTRL3 */
  0x010F4060UL, 0x20000000UL, /* Write: MODEM.CTRL5 */
  /*    4064 */ 0x00000000UL, /* MODEM.CTRL6 */
  /*    4068 */ 0x00F87611UL, /* MODEM.TXBR */
  /*    406C */ 0x00000841UL, /* MODEM.RXBR */
  /*    4070 */ 0x00040048UL, /* MODEM.CF */
  /*    4074 */ 0x004D0012UL, /* MODEM.PRE */
  /*    4078 */ 0x000003EAUL, /* MODEM.SYNC0 */
  /*    407C */ 0x00000000UL, /* MODEM.SYNC1 */
  /*    4080 */ 0x00000609UL, /* MODEM.TIMING */
  /*    4084 */ 0x00000000UL, /* MODEM.DSSS0 */
  /*    4088 */ 0x000A0375UL, /* MODEM.MODINDEX */
  /*    408C */ 0x62088000UL, /* MODEM.AFC */
  /*    4090 */ 0x00000000UL, /* MODEM.AFCADJLIM */
  /*    4094 */ 0x17030000UL, /* MODEM.SHAPING0 */
  /*    4098 */ 0x5454523EUL, /* MODEM.SHAPING1 */
  0x0102411CUL, 0x8C555000UL, /* Write: MODEM.SRCCHF */
  /*    4120 */ 0x00000000UL, /* MODEM.INTAFC */
  0x01074138UL, 0xF00A20BCUL, /* Write: MODEM.DSACTRL */
  /*    413C */ 0x0051B918UL, /* MODEM.DIGMIXCTRL */
  /*    4140 */ 0x40993267UL, /* MODEM.VITERBIDEMOD */
  /*    4144 */ 0xA83FFFFFUL, /* MODEM.VTCORRCFG0 */
  /*    4148 */ 0xB171FF99UL, /* MODEM.VTCORRCFG1 */
  /*    414C */ 0x00403B8BUL, /* MODEM.VTTRACK */
  /*    4150 */ 0x800003C0UL, /* MODEM.VTBLETIMING */
  0x0101415CUL, 0x0000FDFFUL, /* Write: MODEM.CGCLKSTOP */
  0x0106416CUL, 0x40000000UL, /* Write: MODEM.LONGRANGE1 */
  /*    4170 */ 0x00000000UL, /* MODEM.LONGRANGE2 */
  /*    4174 */ 0x00000000UL, /* MODEM.LONGRANGE3 */
  /*    4178 */ 0x00000000UL, /* MODEM.LONGRANGE4 */
  /*    417C */ 0x00000000UL, /* MODEM.LONGRANGE5 */
  /*    4180 */ 0x00000000UL, /* MODEM.LONGRANGE6 */
  0x01044188UL, 0x00000000UL, /* Write: MODEM.COH0 */
  /*    418C */ 0x00000000UL, /* MODEM.COH1 */
  /*    4190 */ 0x00000000UL, /* MODEM.COH2 */
  /*    4194 */ 0x00000000UL, /* MODEM.COH3 */
  0x010141A8UL, 0x00000000UL, /* Write: MODEM.DIGIGAINCTRL */
  0x010141B4UL, 0xC02BD08CUL, /* Write: MODEM.REALTIMCFE */
  0x010341D0UL, 0xAAAAAAAAUL, /* Write: MODEM.TRECPMPATT */
  /*    41D4 */ 0x801680DAUL, /* MODEM.TRECPMDET */
  /*    41D8 */ 0x00020005UL, /* MODEM.TRECSCFG */
  0x010F41E4UL, 0x0451AC29UL, /* Write: MODEM.CHFCOE00 */
  /*    41E8 */ 0x002E1F2FUL, /* MODEM.CHFCOE01 */
  /*    41EC */ 0x0005BDE8UL, /* MODEM.CHFCOE02 */
  /*    41F0 */ 0x002DD3E5UL, /* MODEM.CHFCOE03 */
  /*    41F4 */ 0x0DB17C5EUL, /* MODEM.CHFCOE04 */
  /*    41F8 */ 0x03CEBC0CUL, /* MODEM.CHFCOE05 */
  /*    41FC */ 0x307C262CUL, /* MODEM.CHFCOE06 */
  /*    4200 */ 0x0C81901EUL, /* MODEM.CHFCOE10 */
  /*    4204 */ 0x0006490CUL, /* MODEM.CHFCOE11 */
  /*    4208 */ 0x006DDFA8UL, /* MODEM.CHFCOE12 */
  /*    420C */ 0x00B10BC0UL, /* MODEM.CHFCOE13 */
  /*    4210 */ 0x00A53D18UL, /* MODEM.CHFCOE14 */
  /*    4214 */ 0x05020AE8UL, /* MODEM.CHFCOE15 */
  /*    4218 */ 0x1DD71B27UL, /* MODEM.CHFCOE16 */
  /*    421C */ 0x80000000UL, /* MODEM.CHFCTRL */
  0x01024224UL, 0x800000A8UL, /* Write: MODEM.FRMSCHTIME */
  /*    4228 */ 0x00000000UL, /* MODEM.PREFILTCOEFF */
  0x01024230UL, 0x00480001UL, /* Write: MODEM.SQ */
  /*    4234 */ 0x0018009EUL, /* MODEM.SQEXT */
  0x0101424CUL, 0x14040008UL, /* Write: MODEM.PHDMODCTRL */
  0x01044330UL, 0x00000000UL, /* Write: MODEM.BCRCTRL0 */
  /*    4334 */ 0x00000000UL, /* MODEM.BCRCTRL1 */
  /*    4338 */ 0x00000000UL, /* MODEM.BCRDEMODCTRL */
  /*    433C */ 0x00000000UL, /* MODEM.BCRDEMODOOK */
  0x010A4344UL, 0x00000000UL, /* Write: MODEM.BCRDEMODAFC1 */
  /*    4348 */ 0x00000000UL, /* MODEM.BCRDEMOD4FSK0 */
  /*    434C */ 0x00000000UL, /* MODEM.BCRDEMOD4FSK1 */
  /*    4350 */ 0x00000000UL, /* MODEM.BCRDEMODANT */
  /*    4354 */ 0x00000000UL, /* MODEM.BCRDEMODRSSI */
  /*    4358 */ 0x00000000UL, /* MODEM.BCRDEMODARR0 */
  /*    435C */ 0x38000000UL, /* MODEM.BCRDEMODARR1 */
  /*    4360 */ 0x00000000UL, /* MODEM.BCRDEMODARR2 */
  /*    4364 */ 0x00000000UL, /* MODEM.BCRDEMODKSI */
  /*    4368 */ 0x58FF0000UL, /* MODEM.BCRDEMODPMEXP */
  0x01018038UL, 0x00106E46UL, /* Write: SYNTH.IFFREQ */
  0x010180A4UL, 0x0003B870UL, /* Write: SYNTH.LPFCTRL1TX */
  0x110180ACUL, 0x000001F6UL, /* AND: SYNTH.LPFCTRL2TX */
  0x310180ACUL, 0x01014201UL, /* OR: SYNTH.LPFCTRL2TX */
  0x010180B4UL, 0x02000300UL, /* Write: SYNTH.DSMCTRLTX */
  0x0201016CUL, 0x00062000UL, /* Write: RAC.TX */
  0x02010174UL, 0x0C100169UL, /* Write: RAC.SYTRIM0 */
  0x12010180UL, 0x00000779UL, /* AND: RAC.SYEN */
  0x32010180UL, 0x00000006UL, /* OR: RAC.SYEN */
  0x02010188UL, 0x00000090UL, /* Write: RAC.SYMMDCTRL */
  0xFFFFFFFFUL,
};

const uint32_t zwave_lr_beam_0_modemConfig[] = {
  0x03014FFCUL, (uint32_t) &phyInfo_3, /* Write: SEQ.PHYINFO */
  0x0002400CUL, 0x00000F00UL, /* Write: FRC.DFLCTRL */
  /*    4010 */ 0x00004000UL, /* FRC.MAXLENGTH */
  0x00024020UL, 0x00000007UL, /* Write: FRC.WCNTCMP0 */
  /*    4024 */ 0x00000000UL, /* FRC.WCNTCMP1 */
  0x00014048UL, 0x00000700UL, /* Write: FRC.CTRL */
  0x00044108UL, 0x000040FFUL, /* Write: FRC.FCD0 */
  /*    410C */ 0x00000000UL, /* FRC.FCD1 */
  /*    4110 */ 0x000041FFUL, /* FRC.FCD2 */
  /*    4114 */ 0x00000000UL, /* FRC.FCD3 */
  0x1001C020UL, 0x0007F800UL, /* AND: AGC.CTRL0 */
  0x3001C020UL, 0x002803FEUL, /* OR: AGC.CTRL0 */
  0x0001C03CUL, 0x00000000UL, /* Write: AGC.CTRL7 */
  0x0004C058UL, 0xE61A001CUL, /* Write: AGC.AGCPERIOD0 */
  /*    C05C */ 0x00000054UL, /* AGC.AGCPERIOD1 */
  /*    C060 */ 0x1918150AUL, /* AGC.HICNTREGION0 */
  /*    C064 */ 0x0000001AUL, /* AGC.HICNTREGION1 */
  0x0001C06CUL, 0x00000FE0UL, /* Write: AGC.GAINSTEPLIM0 */
  0x01010008UL, 0x000007A4UL, /* Write: RFCRC.CTRL */
  0x01010018UL, 0x0000F0B8UL, /* Write: RFCRC.INIT */
  0x01010020UL, 0x00008408UL, /* Write: RFCRC.POLY */
  0x01014040UL, 0x00000000UL, /* Write: MODEM.AFCADJRX */
  0x0104404CUL, 0x0413F920UL, /* Write: MODEM.CTRL0 */
  /*    4050 */ 0x00620007UL, /* MODEM.CTRL1 */
  /*    4054 */ 0x00007038UL, /* MODEM.CTRL2 */
  /*    4058 */ 0x00000000UL, /* MODEM.CTRL3 */
  0x010F4060UL, 0x0F016800UL, /* Write: MODEM.CTRL5 */
  /*    4064 */ 0x4024B840UL, /* MODEM.CTRL6 */
  /*    4068 */ 0x00E00555UL, /* MODEM.TXBR */
  /*    406C */ 0x00000841UL, /* MODEM.RXBR */
  /*    4070 */ 0x00000002UL, /* MODEM.CF */
  /*    4074 */ 0x001007B0UL, /* MODEM.PRE */
  /*    4078 */ 0x0000005EUL, /* MODEM.SYNC0 */
  /*    407C */ 0x00000000UL, /* MODEM.SYNC1 */
  /*    4080 */ 0x00006323UL, /* MODEM.TIMING */
  /*    4084 */ 0xC8DD7892UL, /* MODEM.DSSS0 */
  /*    4088 */ 0x000F0018UL, /* MODEM.MODINDEX */
  /*    408C */ 0x60008000UL, /* MODEM.AFC */
  /*    4090 */ 0x00000ABEUL, /* MODEM.AFCADJLIM */
  /*    4094 */ 0x30100101UL, /* MODEM.SHAPING0 */
  /*    4098 */ 0x7F7F7050UL, /* MODEM.SHAPING1 */
  0x0102411CUL, 0x8CE00000UL, /* Write: MODEM.SRCCHF */
  /*    4120 */ 0x00000B59UL, /* MODEM.INTAFC */
  0x01074138UL, 0xF00A2090UL, /* Write: MODEM.DSACTRL */
  /*    413C */ 0x00524C20UL, /* MODEM.DIGMIXCTRL */
  /*    4140 */ 0x00000000UL, /* MODEM.VITERBIDEMOD */
  /*    4144 */ 0x123556B7UL, /* MODEM.VTCORRCFG0 */
  /*    4148 */ 0x50000000UL, /* MODEM.VTCORRCFG1 */
  /*    414C */ 0x00003B80UL, /* MODEM.VTTRACK */
  /*    4150 */ 0x00000000UL, /* MODEM.VTBLETIMING */
  0x0101415CUL, 0x00001E00UL, /* Write: MODEM.CGCLKSTOP */
  0x0106416CUL, 0xC00C1400UL, /* Write: MODEM.LONGRANGE1 */
  /*    4170 */ 0x322A2116UL, /* MODEM.LONGRANGE2 */
  /*    4174 */ 0x4B453E38UL, /* MODEM.LONGRANGE3 */
  /*    4178 */ 0x65435050UL, /* MODEM.LONGRANGE4 */
  /*    417C */ 0x0CCBA987UL, /* MODEM.LONGRANGE5 */
  /*    4180 */ 0xC500AA28UL, /* MODEM.LONGRANGE6 */
  0x01044188UL, 0x64282117UL, /* Write: MODEM.COH0 */
  /*    418C */ 0x001A1714UL, /* MODEM.COH1 */
  /*    4190 */ 0xAAC80420UL, /* MODEM.COH2 */
  /*    4194 */ 0x091A20A1UL, /* MODEM.COH3 */
  0x010141A8UL, 0x00000029UL, /* Write: MODEM.DIGIGAINCTRL */
  0x010141B4UL, 0x00200000UL, /* Write: MODEM.REALTIMCFE */
  0x010341D0UL, 0x00000000UL, /* Write: MODEM.TRECPMPATT */
  /*    41D4 */ 0x000000D0UL, /* MODEM.TRECPMDET */
  /*    41D8 */ 0x00020000UL, /* MODEM.TRECSCFG */
  0x010F41E4UL, 0x0EF1AC1DUL, /* Write: MODEM.CHFCOE00 */
  /*    41E8 */ 0x000C3974UL, /* MODEM.CHFCOE01 */
  /*    41EC */ 0x007680B0UL, /* MODEM.CHFCOE02 */
  /*    41F0 */ 0x00B3DC89UL, /* MODEM.CHFCOE03 */
  /*    41F4 */ 0x00643C93UL, /* MODEM.CHFCOE04 */
  /*    41F8 */ 0x04C789C6UL, /* MODEM.CHFCOE05 */
  /*    41FC */ 0x1D651A8FUL, /* MODEM.CHFCOE06 */
  /*    4200 */ 0x0EF1AC1DUL, /* MODEM.CHFCOE10 */
  /*    4204 */ 0x000C3974UL, /* MODEM.CHFCOE11 */
  /*    4208 */ 0x007680B0UL, /* MODEM.CHFCOE12 */
  /*    420C */ 0x00B3DC89UL, /* MODEM.CHFCOE13 */
  /*    4210 */ 0x00643C93UL, /* MODEM.CHFCOE14 */
  /*    4214 */ 0x04C789C6UL, /* MODEM.CHFCOE15 */
  /*    4218 */ 0x1D651A8FUL, /* MODEM.CHFCOE16 */
  /*    421C */ 0x00000000UL, /* MODEM.CHFCTRL */
  0x01024224UL, 0x0000004CUL, /* Write: MODEM.FRMSCHTIME */
  /*    4228 */ 0xF3CD231DUL, /* MODEM.PREFILTCOEFF */
  0x01024230UL, 0x02800001UL, /* Write: MODEM.SQ */
  /*    4234 */ 0x00400240UL, /* MODEM.SQEXT */
  0x0101424CUL, 0x04000008UL, /* Write: MODEM.PHDMODCTRL */
  0x01044330UL, 0x00000000UL, /* Write: MODEM.BCRCTRL0 */
  /*    4334 */ 0x00000000UL, /* MODEM.BCRCTRL1 */
  /*    4338 */ 0x00000000UL, /* MODEM.BCRDEMODCTRL */
  /*    433C */ 0x00000000UL, /* MODEM.BCRDEMODOOK */
  0x010A4344UL, 0x00000000UL, /* Write: MODEM.BCRDEMODAFC1 */
  /*    4348 */ 0x00000000UL, /* MODEM.BCRDEMOD4FSK0 */
  /*    434C */ 0x00000000UL, /* MODEM.BCRDEMOD4FSK1 */
  /*    4350 */ 0x00000000UL, /* MODEM.BCRDEMODANT */
  /*    4354 */ 0x00000000UL, /* MODEM.BCRDEMODRSSI */
  /*    4358 */ 0x00000000UL, /* MODEM.BCRDEMODARR0 */
  /*    435C */ 0x38000000UL, /* MODEM.BCRDEMODARR1 */
  /*    4360 */ 0x00000000UL, /* MODEM.BCRDEMODARR2 */
  /*    4364 */ 0x00000000UL, /* MODEM.BCRDEMODKSI */
  /*    4368 */ 0x58FF0000UL, /* MODEM.BCRDEMODPMEXP */
  0x01018038UL, 0x00106E46UL, /* Write: SYNTH.IFFREQ */
  0x010180A4UL, 0x000180D8UL, /* Write: SYNTH.LPFCTRL1TX */
  0x110180ACUL, 0x000001F6UL, /* AND: SYNTH.LPFCTRL2TX */
  0x310180ACUL, 0x00511A01UL, /* OR: SYNTH.LPFCTRL2TX */
  0x010180B4UL, 0x01000037UL, /* Write: SYNTH.DSMCTRLTX */
  0x0201016CUL, 0x00012000UL, /* Write: RAC.TX */
  0x02010174UL, 0x0C1B8169UL, /* Write: RAC.SYTRIM0 */
  0x12010180UL, 0x00000779UL, /* AND: RAC.SYEN */
  0x32010180UL, 0x00000002UL, /* OR: RAC.SYEN */
  0x02010188UL, 0x00000050UL, /* Write: RAC.SYMMDCTRL */
  0xFFFFFFFFUL,
};

const RAIL_ChannelConfigEntry_t zwave_40kb_channels[] = {
  {
    .phyConfigDeltaAdd = zwave_40kb_0_modemConfig,
    .baseFrequency = 908400000,
    .channelSpacing = 0,
    .physicalChannelOffset = 0,
    .channelNumberStart = 0,
    .channelNumberEnd = 0,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 1,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = zwave_40kb_0_modemConfig,
    .baseFrequency = 908400000,
    .channelSpacing = 0,
    .physicalChannelOffset = 0,
    .channelNumberStart = 1,
    .channelNumberEnd = 1,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 1,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = zwave_40kb_0_modemConfig,
    .baseFrequency = 908400000,
    .channelSpacing = 0,
    .physicalChannelOffset = 0,
    .channelNumberStart = 2,
    .channelNumberEnd = 2,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 1,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = zwave_40kb_0_modemConfig,
    .baseFrequency = 908400000,
    .channelSpacing = 0,
    .physicalChannelOffset = 0,
    .channelNumberStart = 3,
    .channelNumberEnd = 3,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 1,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
};

const RAIL_ChannelConfigEntry_t zwave_9p6kb_channels[] = {
  {
    .phyConfigDeltaAdd = zwave_9p6kb_0_modemConfig,
    .baseFrequency = 908420000,
    .channelSpacing = 0,
    .physicalChannelOffset = 0,
    .channelNumberStart = 0,
    .channelNumberEnd = 0,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_1,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 3,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = zwave_9p6kb_0_modemConfig,
    .baseFrequency = 908420000,
    .channelSpacing = 0,
    .physicalChannelOffset = 0,
    .channelNumberStart = 1,
    .channelNumberEnd = 1,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_1,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 3,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = zwave_9p6kb_0_modemConfig,
    .baseFrequency = 908420000,
    .channelSpacing = 0,
    .physicalChannelOffset = 0,
    .channelNumberStart = 2,
    .channelNumberEnd = 2,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_1,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 3,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = zwave_9p6kb_0_modemConfig,
    .baseFrequency = 908420000,
    .channelSpacing = 0,
    .physicalChannelOffset = 0,
    .channelNumberStart = 3,
    .channelNumberEnd = 3,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_1,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 3,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
};

const RAIL_ChannelConfigEntry_t zwave_9p6kb_conc_channels[] = {
  {
    .phyConfigDeltaAdd = zwave_9p6kb_conc_0_modemConfig,
    .baseFrequency = 908420000,
    .channelSpacing = 0,
    .physicalChannelOffset = 0,
    .channelNumberStart = 0,
    .channelNumberEnd = 0,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_2,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 2,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = zwave_9p6kb_conc_0_modemConfig,
    .baseFrequency = 908420000,
    .channelSpacing = 0,
    .physicalChannelOffset = 0,
    .channelNumberStart = 1,
    .channelNumberEnd = 1,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_2,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 2,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = zwave_9p6kb_conc_0_modemConfig,
    .baseFrequency = 908420000,
    .channelSpacing = 0,
    .physicalChannelOffset = 0,
    .channelNumberStart = 2,
    .channelNumberEnd = 2,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_2,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 2,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = zwave_9p6kb_conc_0_modemConfig,
    .baseFrequency = 908420000,
    .channelSpacing = 0,
    .physicalChannelOffset = 0,
    .channelNumberStart = 3,
    .channelNumberEnd = 3,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_2,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 2,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
};

