SiliconLabs/simplicity_sdk/platform/radio/rail_lib/chip/efr32/protocol_config/efr32xg23/zwave_efr32xg23_configurator_out.c
const RAIL_ChannelConfigEntry_t zwave_40kb_beam_channels[] = {
  {
    .phyConfigDeltaAdd = zwave_40kb_beam_0_modemConfig,
    .baseFrequency = 908400000,
    .channelSpacing = 0,
    .physicalChannelOffset = 0,
    .channelNumberStart = 0,
    .channelNumberEnd = 0,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_8,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = zwave_40kb_beam_0_modemConfig,
    .baseFrequency = 908400000,
    .channelSpacing = 0,
    .physicalChannelOffset = 0,
    .channelNumberStart = 1,
    .channelNumberEnd = 1,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_8,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = zwave_40kb_beam_0_modemConfig,
    .baseFrequency = 908400000,
    .channelSpacing = 0,
    .physicalChannelOffset = 0,
    .channelNumberStart = 2,
    .channelNumberEnd = 2,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_8,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = zwave_40kb_beam_0_modemConfig,
    .baseFrequency = 908400000,
    .channelSpacing = 0,
    .physicalChannelOffset = 0,
    .channelNumberStart = 3,
    .channelNumberEnd = 3,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_8,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
};

const RAIL_ChannelConfigEntry_t zwave_lr_beam_channels[] = {
  {
    .phyConfigDeltaAdd = zwave_lr_beam_0_modemConfig,
    .baseFrequency = 912000000,
    .channelSpacing = 0,
    .physicalChannelOffset = 0,
    .channelNumberStart = 0,
    .channelNumberEnd = 0,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_9,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = zwave_lr_beam_0_modemConfig,
    .baseFrequency = 912000000,
    .channelSpacing = 0,
    .physicalChannelOffset = 0,
    .channelNumberStart = 1,
    .channelNumberEnd = 1,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_9,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = zwave_lr_beam_0_modemConfig,
    .baseFrequency = 912000000,
    .channelSpacing = 0,
    .physicalChannelOffset = 0,
    .channelNumberStart = 2,
    .channelNumberEnd = 2,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_9,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = zwave_lr_beam_0_modemConfig,
    .baseFrequency = 912000000,
    .channelSpacing = 0,
    .physicalChannelOffset = 0,
    .channelNumberStart = 3,
    .channelNumberEnd = 3,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_9,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
};

const RAIL_ChannelConfig_t zwave_40kb_channelConfig = {
  .phyConfigBase = zwave_40kb_modemConfigBase,
  .phyConfigDeltaSubtract = NULL,
  .configs = zwave_40kb_channels,
  .length = 4U,
  .signature = 0UL,
  .xtalFrequencyHz = 39000000UL,
};

const RAIL_ChannelConfig_t zwave_9p6kb_channelConfig = {
  .phyConfigBase = zwave_40kb_modemConfigBase,
  .phyConfigDeltaSubtract = NULL,
  .configs = zwave_9p6kb_channels,
  .length = 4U,
  .signature = 0UL,
  .xtalFrequencyHz = 39000000UL,
};

const RAIL_ChannelConfig_t zwave_9p6kb_conc_channelConfig = {
  .phyConfigBase = zwave_40kb_modemConfigBase,
  .phyConfigDeltaSubtract = NULL,
  .configs = zwave_9p6kb_conc_channels,
  .length = 4U,
  .signature = 0UL,
  .xtalFrequencyHz = 39000000UL,
};

const RAIL_ChannelConfig_t zwave_100kb_channelConfig = {
  .phyConfigBase = zwave_40kb_modemConfigBase,
  .phyConfigDeltaSubtract = NULL,
  .configs = zwave_100kb_channels,
  .length = 4U,
  .signature = 0UL,
  .xtalFrequencyHz = 39000000UL,
};

const RAIL_ChannelConfig_t zwave_lr_channelConfig = {
  .phyConfigBase = zwave_40kb_modemConfigBase,
  .phyConfigDeltaSubtract = NULL,
  .configs = zwave_lr_channels,
  .length = 4U,
  .signature = 0UL,
  .xtalFrequencyHz = 39000000UL,
};

const RAIL_ChannelConfig_t zwave_100kb_lowside_channelConfig = {
  .phyConfigBase = zwave_40kb_modemConfigBase,
  .phyConfigDeltaSubtract = NULL,
  .configs = zwave_100kb_lowside_channels,
  .length = 2U,
  .signature = 0UL,
  .xtalFrequencyHz = 39000000UL,
};

const RAIL_ChannelConfig_t zwave_100kb_beam_channelConfig = {
  .phyConfigBase = zwave_40kb_modemConfigBase,
  .phyConfigDeltaSubtract = NULL,
  .configs = zwave_100kb_beam_channels,
  .length = 4U,
  .signature = 0UL,
  .xtalFrequencyHz = 39000000UL,
};

const RAIL_ChannelConfig_t zwave_100kb_beam_lowside_channelConfig = {
  .phyConfigBase = zwave_40kb_modemConfigBase,
  .phyConfigDeltaSubtract = NULL,
  .configs = zwave_100kb_beam_lowside_channels,
  .length = 2U,
  .signature = 0UL,
  .xtalFrequencyHz = 39000000UL,
};

const RAIL_ChannelConfig_t zwave_40kb_beam_channelConfig = {
  .phyConfigBase = zwave_40kb_modemConfigBase,
  .phyConfigDeltaSubtract = NULL,
  .configs = zwave_40kb_beam_channels,
  .length = 4U,
  .signature = 0UL,
  .xtalFrequencyHz = 39000000UL,
};

const RAIL_ChannelConfig_t zwave_lr_beam_channelConfig = {
  .phyConfigBase = zwave_40kb_modemConfigBase,
  .phyConfigDeltaSubtract = NULL,
  .configs = zwave_lr_beam_channels,
  .length = 4U,
  .signature = 0UL,
  .xtalFrequencyHz = 39000000UL,
};

uint32_t zwaveAccelerationBuffer[251];
